{
  "configuration" : { },
  "description" : "Description",
  "documentation" : {
    "decisions" : [ {
      "content" : "# 1. Record architecture decisions\n\n## Status\nAccepted\n\n## Context\nWe will record the architectural decisions made on this project.\n\n## Decision\nWe will use Architecture Decision Records, as described by Michael Nygard in this article: [Documenting Architecture Decisions](http://thinkrelevance.com/blog/2011/11/15/documenting-architecture-decisions)\n\n## Consequences\nSee Michael Nygard's article, linked above.\n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "1",
      "status" : "Accepted",
      "title" : "Record architecture decisions"
    }, {
      "content" : "# 1. Microservices Architecture\n\n## Status\nAccepted\n\n## Context\nIn order to showcase the Epic Saga pattern, we need to provide atomic database consistency of the system.\n\n## Decision\nWe will use a Microservices architectural style to implement the distributed services. The simplest style to achieve atomic consistency would to use a monolithic style, such as a Layered Monolith, but the idea is to experience the trade-offs when using the saga in a distributed architecture. A Service-Oriented architecture was also considered, due to the sharing of a database, but that didn't provide any benefits and introduced potential unwanted coupling at the persistence level. \n\n## Consequences\nEach distributed service will connect to the same database but will use their own schema, keeping the database namespace nice and tidy. Since each domain is implemented in its own process, the Orchestrator will have to issue compensating transactions when dealing with service failures. Fault handling is the most difficult part of this saga type and should provide an excellent learning experience. \n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "2",
      "status" : "Accepted",
      "title" : "Microservices Architecture"
    }, {
      "content" : "# 1. Use Kotlin For Production Code\n\n## Status\nAccepted\n\n## Context\nModern Java has improved the programmer experience but Kotlin, in our opinion, provides a better one.\n\n## Decision\nWe will use [Kotlin](https://kotlinlang.org/) to develop the production modules. Test will use Java, primarily due to some complexity in getting Cucumber and Kotlin to play nicely together.\n\n## Consequences\nKotlin has many features baked into the language that require extra libraries to accomplish in Java, e.g. Lombok. Fewer dependencies means fewer upgrade headaches in the future.\n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "3",
      "status" : "Accepted",
      "title" : "Use Kotlin For Production Code"
    }, {
      "content" : "# 1. Use Explicit Contexts\n\n## Status\nAccepted\n\n## Context\nMichael Nygard has a very interesting idea that should allow system to evolve over time. From his book [Release It!]():\n\n>Suppose your service receives this fragment of JSON inside a request: `{\"item\": \"029292934\"}`\n>\n>How much do we know about the item? Is that string the item itself? Or is it an item identifier? Maybe the field would be better named “itemID.” Supposing that it is an identifier, our service can’t do very much with it. In fact, only four things are possible:\n>\n>1. Pass it through as a token to other services. (This includes returning it to the same caller in the future.)\n>2. Look it up by calling another service.\n>3. Look it up in our own database.\n>4. Discard it.\n>\n>In the first case, we’re just using the “itemID” as a token. We don’t care about the internal structure. In this case it would be a mistake to convert it from string to numeric. We’d be imposing a restriction that doesn’t add any value and will probably need to be changed—with huge disruption—in the future.\n>\n>In the second and third cases, we’re using the “itemID” as something we can resolve to get more information. But there’s a serious problem here. The bare string shown earlier doesn’t tell us who has the authoritative information. If the answer isn’t in our own database, we need to call another service. Which service?\n>\n>This issue is so pervasive that it does not even look like a problem at first. In order to get item information, your service must already know who to call! That’s an implicit dependency.\n>\n>That implicit dependency limits you to working with just the one service provider. If you need to support items from two different “universes,” it’s going to be very disruptive.\n>\n>Suppose instead the initial fragment of JSON looked like this: `{\"itemID\": \"https://example.com/policies/029292934\"}`\n>\n>This URL still works if we just want to use it as an opaque token to pass forward. From one perspective, it’s still just a Unicode string.\n>\n>This URL also still works if we need to resolve it to get more information. But now our service does not have to bake in knowledge of the solitary authority. We can support more than one of them.\n>\n>By the way, using a full URL also makes integration testing easier. We no longer need “test” versions of the other services. We can supply our own test harnesses and use URLs to those instead of the production authorities.\n>\n>This example is all in the context of interservice communication. But making implicit context into explicit context has big benefits inside services as well. If you’ve worked on a Ruby on Rails system, you might have run into difficulty when trying to use multiple relational databases from a single service. That’s because ActiveRecord uses an implicit database connection. This is convenient when there’s just one database, but it becomes a hindrance when you need more than one.\n>\n>Global state is the most insidious form of implicit context. That include configuration parameters. These will slow you down when you need to go from “one” to “more than one” of a collaboration.\n\n## Decision\nWhen possible, we will use a URI as the primary key for objects. Depending on the system in question, it may not be an easily resolvable location and may have to be deconstructed a bit before getting to something readable. For example: `mongodb:read-only-user@mongodb.example.com:5762/some-dataset?_id=9876` probably won't have an available protocol handler, so one must be written.  \n\n## Consequences\nIf we can use stable names for the authority portion of the URI, we should be able to move services around and still have systems find the data they need. One element we have to be keenly aware of is that changing the scheme portion later will be very difficult, if not impossible. If available, an HTTP or GraphQL URI should be preferred over direct database or coordinates. In practical terms, this means that we still use database generated primary keys but return a URL as the ID of the asset.  For example, document `1234` would be exposed to the caller as `http://alpha.test.example.com/user/1234`. If that URI is ever \"tugged\" on, hyperlinks are provided to other possible operations on the resource.\n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "4",
      "status" : "Accepted",
      "title" : "Use Explicit Contexts"
    }, {
      "content" : "# 1. Use Mark Richards' \"arrow\" Notation\n\n## Status\nAccepted\n\n## Context\nLooking at a static diagram, especially when printed on a black and white printer, it can be difficult to quickly grasp how each component interacts with others. In particular, the use of arrows and lines are often ambiguous and/or misleading, decreasing the understandability of the diagram.\n\n## Decision\n[Mark Richards](https://developertoarchitect.com/lessons/) has a simple set of conventions when it comes to lines and arrows that we will incorporate into our C4 views: [Lesson 94 - Guidelines for Architecture Diagrams](https://developertoarchitect.com/lessons/lesson94.html) and [Lesson 95 - Guidelines for Architecture Diagrams Revisited](https://developertoarchitect.com/lessons/lesson95.html).\n\n## Consequences\nBy taking using a simple convention when it comes to line and arrow use, people should more quickly understand what is being diagrammed with less ambiguity.\n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "5",
      "status" : "Accepted",
      "title" : "Use Mark Richards' \"arrow\" Notation"
    }, {
      "content" : "# 1. Use Request State Management to simulate the Isolated portion of ACID\n\n## Status\nAccepted\n\n## Context\nThe Epic Saga requires that we provide atomic consistency across our distributed transaction. Not an easy feat to accomplish.\n\n## Decision\nIn [Lesson 176 - Compensating Updates Revisited](https://youtu.be/_lZ7JJVNKcc?si=bXe7J52YtHakjFND), Mark Richards provides an alternative to using compensating operations to keep the system in a consistent state.\n\n## Consequences\nEach service will be required to use [Apache Ignite](https://ignite.apache.org/), probably behind Spring Boot's cache abstraction, to keep the current state of the in-flight operation's state current. This does a couple things, including allowing the workflow to resume from a failed step if some self-healing has occurred.\n\n## Compliance\nBeing a learning project, no effort will be made to enforce the use of decision records.\n\n## Notes\n",
      "date" : "2025-01-11T16:53:33Z",
      "format" : "Markdown",
      "id" : "6",
      "status" : "Accepted",
      "title" : "Use Request State Management to simulate the Isolated portion of ACID"
    } ],
    "sections" : [ {
      "content" : "== Context\nBuyMore online is an ecommerce site, selling mostly widgets. The workflow is typical of other sites where, after the purchase is fulfilled, an e-mail notification is sent to the customer. It is very important that any service failures during the workflow get reverted as quickly as possible. We don't want an angry customer because we charged her for something that never shipped!\n\nWARNING: figure out how to embed the context diagram",
      "filename" : "01-context.adoc",
      "format" : "AsciiDoc",
      "order" : 1,
      "title" : ""
    }, {
      "content" : "== Functional Overview\n. Highlight and summarize major functions of the software\n. Is it clear what the system actually does?\n. Is it clear which features, functions, use cases, user stories, etc are significant to the architecture and why?\n. Is it clear who the important users are (roles, actors, personas, etc) and how the system caters for their needs?\n. Is it clear that the above has been used to shape and define the architecture?\n. Is it clear what the system does from a process perspective?\n. What are the major processes and flows of information through the system?\n. Feel free to reference existing documentation\n. The goal is to provide an *overview*\n. Sequence diagram when discussing automated business processes is useful\n. Technical and non-technical people, both inside and outside the immediate development team\n",
      "filename" : "02-functional-overview.adoc",
      "format" : "AsciiDoc",
      "order" : 2,
      "title" : ""
    }, {
      "content" : "== Quality Attributes\n. Summarize key quality attributes\n. Performance (e.g. latency and throughput)\n. Scalability (e.g. data and traffic volumes)\n. Availability (e.g. uptime, downtime, scheduled maintenance, 24x7, 99.9%, etc)\n. Security (e.g. authentication, authorization, data confidentiality, etc)\n. Extensibility\n. Auditing\n. Monitoring and management\n. Reliability\n. Failover/disaster recovery targets (e.g. manual vs automatic, how long will it take?)\n. Business continuity\n. Interoperability\n. Legal, compliance and regulatory requirements (e.g. data protection act)\n. I18n and L10n\n. Accessibility\n. Usability\n. Use SMART (specific, measurable, achievable, relevant and timely) attributes\n. Technical people only",
      "filename" : "03-quality-attributes.adoc",
      "format" : "AsciiDoc",
      "order" : 3,
      "title" : ""
    }, {
      "content" : "== Constraints\n. Summarize the constraints your are working in and some of the decisions that have been made for you\n. Time, budget and resources\n. Approved technology lists and technology constraints\n. Target deployment platform\n. Existing systems and integration standards\n. Local standards (e.g. development, coding, etc)\n. Public standards (e.g. HTTP, SOAP, XML, XML Schema, WSDL, etc)\n. Standard protocols\n. Standard message formats\n. Size of software development team\n. Skill profile of the development team\n. Nature of the software being build (et, tactical or strategic)\n. Political constraints\n. Use of internal intellectual property\n. Technical and non-technical people\n\nWe're a small company with a limited development budget but we do expect that system to become increasingly popular. GURPS Online is built using as a loosely coupled monolith, meaning that there is a single code base but it is structured in such a way that parts of it can be moved out into its own system as needed. This keeps the initial development costs down while providing a path in the future for growth.  Our developers are skilled JVM programmers but we don't have the time or budget to create any bespoke frameworks for this solution. For that reason, the system is built using frameworks plucked from the Spring ecosystem. Further, we're using Kotlin running on contemporary JVM releases, giving us further productivity gains.\n",
      "filename" : "04-constraints.adoc",
      "format" : "AsciiDoc",
      "order" : 4,
      "title" : ""
    }, {
      "content" : "== Principles\n. Make it explicit what principles are being followed\n. Supply existing references, if they exist\n. Architectural layering strategy\n. No business logic in views\n. No database access in views\n. Use of interfaces\n. Always use an ORM\n. Dependency injection\n. The Hollywood principle\n. High cohesion, low coupling\n. Follow SOLID\n. DRY\n. Ensure all components are stateless (e.g. to ease scaling)\n. Prefer a rich domain model\n. Prefer an anemic domain model\n. Prefer stored procedures\n. Avoid stored procedures\n. Don't reinvent the wheel\n. Approaches to error handling, logging, etc\n. Buy rather than build\n. Technical people only\n\n=== Package By Feature\nThe desire to more easily extract features into separate services is a priority. Traditional layering strategies, such a Hexagonal Architecture, will not help in this regard. Instead, we use a packaging concept described in https://youtu.be/5OjqD-ow8GE[Modular Monoliths] and https://youtu.be/48C-RsEu0BQ[Creating a Loosely Coupled Monolith]. The main idea is that each capability of the system is partitioned into its own \"slice\" of the code base. We've taken the approach of using Maven modules as the primary partitioning construct. Unfortunately, Kotlin's `internal` does not work in multi-module Maven projects, so we cannot depend on the compiler in preventing cross-feature coupling. At the persistence layer, we use the same physical database host but give each module its own namespace, preventing modules from directly accessing each other's data. Lastly, we use messaging when interacting with modules, decoupling them in space and time. Only the message broker needs to be available for the system to function.",
      "filename" : "05-principles.adoc",
      "format" : "AsciiDoc",
      "order" : 5,
      "title" : ""
    }, {
      "content" : "== Software Architecture\n* Summarize the software architecture\n* What does the \"big picture\" look like?\n* Is there a clear structure?\n* Is it clear how the system works from the \"30,000 foot view\"?\n* Does it show major containers and technology choices?\n* Does it show major components and their interactions?\n* What are the key internal interfaces? (e.g. web service between web and business tiers)\n* Technical people only",
      "filename" : "06-software-architecture.adoc",
      "format" : "AsciiDoc",
      "order" : 6,
      "title" : ""
    }, {
      "content" : "== External Interfaces\n. What are the key external interfaces?\n.. system-to-system\n.. publicly exposed APIs\n.. exported files\n. Has each interface been thought about from a technical perspective?\n.. what is the technical definition of an interface?\n.. if messaging is being used, which queues and topics are components using to communicate?\n.. what format are the messages (e.g. plain text, Avro, JSON)?\n.. are they synchronous or asynchronous?\n.. are asynchronous messaging links guaranteed?\n.. are subscribers durable where necessary?\n.. can messages be received out of order and is this a problem?\n.. are interfaces idempotent?\n.. is the interface always available or do you need the cache data locally?\n.. how is performance/security/etc catered for?\n. Has each interface been thought about from a non-technical perspective?\n.. who has ownership of the interface?\n.. how often does the interface change and how is versioning handled?\n.. are there service-level agreements in place?\n. A paragraph on each interface covering this topics is sufficient\n. Technical people only",
      "filename" : "07-external-interfaces.adoc",
      "format" : "AsciiDoc",
      "order" : 7,
      "title" : ""
    }, {
      "content" : "== Code\n. Describe implementation details for important/complex parts of the system\n. homegrown frameworks\n. WebMVC frameworks\n. approach to security\n. domain model\n. component frameworks\n. configuration mechanisms\n. architectural layering\n. exceptions and logging\n. how patterns and principals are implemented\n. short description of each element using diagrams as necessary\n. Technical people only",
      "filename" : "08-code.adoc",
      "format" : "AsciiDoc",
      "order" : 8,
      "title" : ""
    }, {
      "content" : "== Data\n. Record anything that is important from the data perspective\n. What does the data model look like?\n. Where is data stored?\n. Who owns the data?\n. How much storage space is needed for the data?\n. Are there any requirements for long term archival?\n. Are there any requirements for log files and audit trails?\n. Are flat files being used for storage?\n. short description of each element using diagrams as necessary\n. Technical people only, including Operations",
      "filename" : "09-data.adoc",
      "format" : "AsciiDoc",
      "order" : 9,
      "title" : ""
    }, {
      "content" : "== Infrastructure Architecture\n. Describe the physical/virtual hardware and networks the software will be deployed to.\n. Is there a clear physical architecture?\n. What hardware does this include across all tiers?\n. Does it cater for redundancy, failover and disaster recovery if applicable?\n. Is it clear how the chosen hardware components have been sized and selected?\n. If multiple servers and sites are used, what are the network links between them?\n. Who is responsible for support and maintenance of the infrastructure?\n. Are there central teams to look after common infrastructure?\n. Who owns the resources?\n. Are there sufficient environments for development, testing, acceptance, pre-production, production?\n. Provide an infrastructure/network diagram with a short narrative\n. Technical people only, including Operations",
      "filename" : "10-infrastructure-architecture.adoc",
      "format" : "AsciiDoc",
      "order" : 10,
      "title" : ""
    }, {
      "content" : "== Deployment\n. Describe the mapping between software (containers) and the infrastructure.\n. How and where is the software installed and configured?\n. Is it clear how the software will be deployed across the infrastructure elements described in the Infrastructure Architecture section?\n. What are the options and have they been documented?\n. Is it understood how memory and CPU will be partitioned between the processes running on a single piece of infrastructure?\n. Are any containers/components running in an active-active, active-passive, hot-standby, cold-standby formation?\n. Has the deployment and rollback strategy been defined?\n. What happens in the event of a software or infrastructure failure?\n. Is it clear how data is replicated across sites?\n. Can use tables to show mapping between containers and infrastructure\n. Can use UML deployment diagrams\n. Can use color coding to designate runtime status (primary vs secondary, etc_",
      "filename" : "11-deployment.adoc",
      "format" : "AsciiDoc",
      "order" : 11,
      "title" : ""
    }, {
      "content" : "== Operation and Support\n. Be explicit about to run, monitor and manage the software\n. Is it clear how the software provides the ability for Operations to monitor and manage the system?\n. Has is this achieved across all tiers of the architecture?\n. How can Operations diagnose problems?\n. Where are errors and information logged?\n. Do configuration changes require a restart?\n. Are there any manual housekeeping tasks that need to be performed on a regular basis?\n. Does old data need to be periodically archived?\n. A simple narrative should suffice here\n. Technical people only, including Operations",
      "filename" : "12-operation-and-support.adoc",
      "format" : "AsciiDoc",
      "order" : 12,
      "title" : ""
    }, {
      "content" : "== Development Environment\n. Summarize how new team members set up a development environment\n. Pre-requisite versions of software needed\n. Links to software downloads\n. Links to virtual machines\n. Environment variables\n. Host name entries\n. IDE configuration\n. Build and test instructions\n. Database population scripts\n. Username, passwords and certificates for connecting to services\n. Links to build servers\n. Technical people only, developers specifically",
      "filename" : "13-deveopment-environment.adoc",
      "format" : "AsciiDoc",
      "order" : 13,
      "title" : ""
    }, {
      "content" : "== Decision Log\n. Capture major decisions that have been made\n. Why did you choose technology/framework X over Y and Z?\n. How did you make the selection? PoC? Product evaluation?\n. Did corporate policy or architecture standards force you to select X?\n. Why did you choose the selected architecture?  What other options did you consider?\n. How do you know that the solution satisfies the major non-functional requirements?\n. Short paragraph describing each decision. Include a date of the decision?\n. Technical people only",
      "filename" : "14-decision-log.adoc",
      "format" : "AsciiDoc",
      "order" : 14,
      "title" : ""
    } ]
  },
  "id" : 1,
  "lastModifiedAgent" : "structurizr-ui",
  "lastModifiedDate" : "2025-01-11T16:53:48Z",
  "model" : {
    "softwareSystems" : [ {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Alpha",
      "id" : "1",
      "location" : "Unspecified",
      "name" : "Xray",
      "properties" : {
        "structurizr.dsl.identifier" : "bb78cb63-ef5c-4b80-8f1c-50af6a78abad"
      },
      "tags" : "Element,Software System"
    }, {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Alpha",
      "id" : "2",
      "location" : "Unspecified",
      "name" : "Whiskey",
      "properties" : {
        "structurizr.dsl.identifier" : "ebd1124d-a459-489f-a68a-4c53953c8deb"
      },
      "tags" : "Element,Software System"
    }, {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Bravo",
      "id" : "3",
      "location" : "Unspecified",
      "name" : "Yankee",
      "properties" : {
        "structurizr.dsl.identifier" : "cb894ade-387e-4c42-ad0f-98144328fc7e"
      },
      "tags" : "Element,Software System"
    }, {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Bravo",
      "id" : "4",
      "location" : "Unspecified",
      "name" : "Victor",
      "properties" : {
        "structurizr.dsl.identifier" : "423cf1cd-81b8-443b-9ebf-8f9bde0a121a"
      },
      "tags" : "Element,Software System"
    }, {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Charlie",
      "id" : "5",
      "location" : "Unspecified",
      "name" : "Zulu",
      "properties" : {
        "structurizr.dsl.identifier" : "1fb72c48-bdf0-442e-b347-98d6a6ca6c7f"
      },
      "tags" : "Element,Software System"
    }, {
      "description" : "Some system",
      "documentation" : { },
      "group" : "Business Unit Charlie",
      "id" : "6",
      "location" : "Unspecified",
      "name" : "Uniform",
      "properties" : {
        "structurizr.dsl.identifier" : "a3148bfa-3b5a-4fd6-aabd-f2c5b58fd128"
      },
      "tags" : "Element,Software System"
    } ]
  },
  "name" : "Can C4 Handle Large Diagrams",
  "properties" : {
    "structurizr.dsl" : "IyBodHRwczovL2dpdGh1Yi5jb20vc3RydWN0dXJpenIvZHNsL2Jsb2IvbWFzdGVyL2RvY3MvbGFuZ3VhZ2UtcmVmZXJlbmNlLm1kCgojKFBlcnNvbnxTb2Z0d2FyZVN5c3RlbXxDb250YWluZXJ8Q29tcG9uZW50fERlcGxveW1lbnROb2RlfEluZnJhc3RydWN0dXJlTm9kZXxTb2Z0d2FyZVN5c3RlbUluc3RhbmNlfENvbnRhaW5lckluc3RhbmNlfEN1c3RvbSkKCiFjb25zdCBDT0RFX05BTUUgIlByb2plY3QgQWxwaGEiCiFjb25zdCBHUk9VUF9OQU1FICJHcm91cCIKCi8qCm11bHRpIGxpbmUKKi8KCiMgc2luZ2xlIGxpbmUKLy8gc2luZ2xlIGxpbmUKCndvcmtzcGFjZSAiQ2FuIEM0IEhhbmRsZSBMYXJnZSBEaWFncmFtcyIgewogICAgIWlkZW50aWZpZXJzIGZsYXQKICAgICFpbXBsaWVkUmVsYXRpb25zaGlwcyB0cnVlCiAgICMhaW5jbHVkZSA8ZmlsZXxkaXJlY3Rvcnl8dXJsPgoKICAgICFkb2NzIGRvY3VtZW50cwogICAgIWFkcnMgZGVjaXNpb25zCgogICAgIWNvbnN0IEZPTyAiU29tZSB0ZXh0IHlvdSB3YW50IHRvIHJldXNlLiIKCiAgICBtb2RlbCB7CiAgICAgICAgZ3JvdXAgIkJ1c2luZXNzIFVuaXQgQWxwaGEiIHsKICAgICAgICAgICAgc29mdHdhcmVTeXN0ZW0gIlhyYXkiIHsKICAgICAgICAgICAgICAgIGRlc2NyaXB0aW9uICJTb21lIHN5c3RlbSIKICAgICAgICAgICAgICAgIHBlcnNwZWN0aXZlcyB7CiAgICAgICAgICAgICAgICB9CiAgICAgICAgICAgIH0KICAgICAgICAgICAgc29mdHdhcmVTeXN0ZW0gIldoaXNrZXkiIHsKICAgICAgICAgICAgICAgIGRlc2NyaXB0aW9uICJTb21lIHN5c3RlbSIKICAgICAgICAgICAgICAgIHBlcnNwZWN0aXZlcyB7CiAgICAgICAgICAgICAgICB9CiAgICAgICAgICAgIH0KICAgICAgICB9CiAgICAgICAgZ3JvdXAgIkJ1c2luZXNzIFVuaXQgQnJhdm8iIHsKICAgICAgICAgICAgc29mdHdhcmVTeXN0ZW0gIllhbmtlZSIgewogICAgICAgICAgICAgICAgZGVzY3JpcHRpb24gIlNvbWUgc3lzdGVtIgogICAgICAgICAgICAgICAgcGVyc3BlY3RpdmVzIHsKICAgICAgICAgICAgICAgIH0KICAgICAgICAgICAgfQogICAgICAgICAgICBzb2Z0d2FyZVN5c3RlbSAiVmljdG9yIiB7CiAgICAgICAgICAgICAgICBkZXNjcmlwdGlvbiAiU29tZSBzeXN0ZW0iCiAgICAgICAgICAgICAgICBwZXJzcGVjdGl2ZXMgewogICAgICAgICAgICAgICAgfQogICAgICAgICAgICB9CiAgICAgICAgfQogICAgICAgIGdyb3VwICJCdXNpbmVzcyBVbml0IENoYXJsaWUiIHsKICAgICAgICAgICAgc29mdHdhcmVTeXN0ZW0gIlp1bHUiIHsKICAgICAgICAgICAgICAgIGRlc2NyaXB0aW9uICJTb21lIHN5c3RlbSIKICAgICAgICAgICAgICAgIHBlcnNwZWN0aXZlcyB7CiAgICAgICAgICAgICAgICB9CiAgICAgICAgICAgIH0KICAgICAgICAgICAgc29mdHdhcmVTeXN0ZW0gIlVuaWZvcm0iIHsKICAgICAgICAgICAgICAgIGRlc2NyaXB0aW9uICJTb21lIHN5c3RlbSIKICAgICAgICAgICAgICAgIHBlcnNwZWN0aXZlcyB7CiAgICAgICAgICAgICAgICB9CiAgICAgICAgICAgIH0KICAgICAgICB9CiAgICB9CgogICAgIyBodHRwczovL3Zpc21lLmNvL2Jsb2cvd2Vic2l0ZS1jb2xvci1zY2hlbWVzLwogICAgdmlld3MgewogICAgICAgIHRoZW1lIGRlZmF1bHQKICAgICAgICBzdHlsZXMgewogICAgICAgICAgICBlbGVtZW50ICJNZXNzYWdlQnJva2VyIiB7CiAgICAgICAgICAgICAgICBzaGFwZSBDeWxpbmRlcgogICAgICAgICAgICAgICAgYmFja2dyb3VuZCAjRThBODdDCiAgICAgICAgICAgIH0KICAgICAgICAgICAgZWxlbWVudCAiRGF0YVN0b3JlIiB7CiAgICAgICAgICAgICAgICBzaGFwZSBDeWxpbmRlcgogICAgICAgICAgICAgICAgYmFja2dyb3VuZCAjRTI3RDYwCiAgICAgICAgICAgIH0KICAgICAgICAgICAgZWxlbWVudCAiQ3JvbiIgewogICAgICAgICAgICAgICAgc2hhcGUgUm9ib3QKICAgICAgICAgICAgfQogICAgICAgICAgICBlbGVtZW50ICJGaWxlU3RvcmUiIHsKICAgICAgICAgICAgICAgIHNoYXBlIEZvbGRlcgogICAgICAgICAgICAgICAgYmFja2dyb3VuZCAjZGFjMjkyCiAgICAgICAgICAgIH0KICAgICAgICAgICAgIyBzaGFwZSA8Qm94fFJvdW5kZWRCb3h8Q2lyY2xlfEVsbGlwc2V8SGV4YWdvbnxDeWxpbmRlcnxQaXBlfFBlcnNvbnxSb2JvdHxGb2xkZXJ8V2ViQnJvd3NlcnxNb2JpbGVEZXZpY2VQb3J0cmFpdHxNb2JpbGVEZXZpY2VMYW5kc2NhcGV8Q29tcG9uZW50PgogICAgICAgICAgICBlbGVtZW50ICJDaGFubmVsIiB7CiAgICAgICAgICAgICAgICBzaGFwZSBQaXBlCiAgICAgICAgICAgICAgICBiYWNrZ3JvdW5kICNDMzhEOUUKICAgICAgICAgICAgfQogICAgICAgICAgICBlbGVtZW50ICJDaGFubmVsIEFkYXB0ZXIiIHsKICAgICAgICAgICAgICAgIHNoYXBlIEVsbGlwc2UKICAgICAgICAgICAgICAgIGJhY2tncm91bmQgIzQxQjNBMwogICAgICAgICAgICB9CiAgICAgICAgICAgIGVsZW1lbnQgIk1pY3Jvc2VydmljZSIgewogICAgICAgICAgICAgICAgc2hhcGUgSGV4YWdvbgogICAgICAgICAgICB9CiAgICAgICAgICAgIGVsZW1lbnQgIkNvbW1hbmRMaW5lIiB7CiAgICAgICAgICAgICAgICBzaGFwZSBCb3gKICAgICAgICAgICAgfQogICAgICAgICAgICBlbGVtZW50ICJXZWJVSSIgewogICAgICAgICAgICAgICAgc2hhcGUgV2ViQnJvd3NlcgogICAgICAgICAgICB9CgogICAgICAgICAgICByZWxhdGlvbnNoaXAgImFzeW5jLW9uZS13YXkiIHsKICAgICAgICAgICAgICAgIHRoaWNrbmVzcyAyCiAgICAgICAgICAgICAgICBzdHlsZSBkb3R0ZWQKICAgICAgICAgICAgICAgIGNvbG9yICMyNDI1ODIKICAgICAgICAgICAgfQogICAgICAgICAgICByZWxhdGlvbnNoaXAgInN5bmMtb25lLXdheSIgewogICAgICAgICAgICAgICAgdGhpY2tuZXNzIDIKICAgICAgICAgICAgICAgIHN0eWxlIHNvbGlkCiAgICAgICAgICAgICAgICBjb2xvciAjMDAwMEZGCiAgICAgICAgICAgIH0KICAgICAgICAgICAgcmVsYXRpb25zaGlwICJzeW5jLXR3by13YXkiIHsKICAgICAgICAgICAgICAgIHRoaWNrbmVzcyAyCiAgICAgICAgICAgICAgICBzdHlsZSBzb2xpZAogICAgICAgICAgICAgICAgY29sb3IgIzU1M0Q2NwogICAgICAgICAgICB9CiAgICAgICAgICAgIHJlbGF0aW9uc2hpcCAianNvbi1vdmVyLW1vbmdvZGItd2lyZS1wcm90b2NvbCIgewogICAgICAgICAgICAgICAgdGhpY2tuZXNzIDIKICAgICAgICAgICAgICAgIHN0eWxlIGRvdHRlZAogICAgICAgICAgICAgICAgY29sb3IgI0Y2NEM3MgogICAgICAgICAgICB9CiAgICAgICAgICAgIHJlbGF0aW9uc2hpcCAiamRiYy1kcml2ZXIiIHsKICAgICAgICAgICAgICAgIHRoaWNrbmVzcyAyCiAgICAgICAgICAgICAgICBzdHlsZSBkb3R0ZWQKICAgICAgICAgICAgICAgIGNvbG9yICNGNjRDNzIKICAgICAgICAgICAgfQogICAgICAgIH0KLyoKICAgICAgICAjIGZyb20gbWlzY29uY2VwdGlvbiB0YWxrCiAgICAgICAgY29udGFpbmVyIGJ1eW1vcmUgewogICAgICAgICAgICBpbmNsdWRlIC0+ZGF0YWJhc2UtPgogICAgICAgIH0KICAgICAgICBjb250YWluZXIgYnV5bW9yZSB7CiAgICAgICAgICAgIGluY2x1ZGUgLT5vcmRlclBsYWNlbWVudFNlcnZpY2UtPgogICAgICAgIH0KICAgICAgICBjb250YWluZXIgYnV5bW9yZSB7CiAgICAgICAgICAgIGluY2x1ZGUgLT5wYXltZW50U2VydmljZS0+CiAgICAgICAgfQogICAgICAgIGNvbnRhaW5lciBidXltb3JlIHsKICAgICAgICAgICAgaW5jbHVkZSAtPmZ1bGZpbGxtZW50U2VydmljZS0+CiAgICAgICAgfQogICAgICAgIGNvbnRhaW5lciBidXltb3JlIHsKICAgICAgICAgICAgaW5jbHVkZSAtPmVtYWlsU2VydmljZS0+CiAgICAgICAgfQogICAgICAgIGNvbnRhaW5lciBidXltb3JlIHsKICAgICAgICAgICAgaW5jbHVkZSAtPm9yY2hlc3RyYXRvci0+CiAgICAgICAgfQogICAgICAgY29udGFpbmVyIGJ1eW1vcmUgewogICAgICAgICAgIGluY2x1ZGUgb3JkZXJQbGFjZW1lbnRTZXJ2aWNlIGVtYWlsU2VydmljZQogICAgICAgfQoqLwogICAgfQp9"
  },
  "views" : {
    "configuration" : {
      "branding" : { },
      "lastSavedView" : "SystemLandscape-001",
      "metadataSymbols" : "SquareBrackets",
      "styles" : {
        "elements" : [ {
          "background" : "#e8a87c",
          "shape" : "Cylinder",
          "tag" : "MessageBroker"
        }, {
          "background" : "#e27d60",
          "shape" : "Cylinder",
          "tag" : "DataStore"
        }, {
          "shape" : "Robot",
          "tag" : "Cron"
        }, {
          "background" : "#dac292",
          "shape" : "Folder",
          "tag" : "FileStore"
        }, {
          "background" : "#c38d9e",
          "shape" : "Pipe",
          "tag" : "Channel"
        }, {
          "background" : "#41b3a3",
          "shape" : "Ellipse",
          "tag" : "Channel Adapter"
        }, {
          "shape" : "Hexagon",
          "tag" : "Microservice"
        }, {
          "shape" : "Box",
          "tag" : "CommandLine"
        }, {
          "shape" : "WebBrowser",
          "tag" : "WebUI"
        } ],
        "relationships" : [ {
          "color" : "#242582",
          "style" : "Dotted",
          "tag" : "async-one-way",
          "thickness" : 2
        }, {
          "color" : "#0000ff",
          "style" : "Solid",
          "tag" : "sync-one-way",
          "thickness" : 2
        }, {
          "color" : "#553d67",
          "style" : "Solid",
          "tag" : "sync-two-way",
          "thickness" : 2
        }, {
          "color" : "#f64c72",
          "style" : "Dotted",
          "tag" : "json-over-mongodb-wire-protocol",
          "thickness" : 2
        }, {
          "color" : "#f64c72",
          "style" : "Dotted",
          "tag" : "jdbc-driver",
          "thickness" : 2
        } ]
      },
      "terminology" : { },
      "themes" : [ "https://static.structurizr.com/themes/default/theme.json" ]
    },
    "systemContextViews" : [ {
      "automaticLayout" : {
        "applied" : false,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "elements" : [ {
        "id" : "6",
        "x" : 0,
        "y" : 0
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-001",
      "order" : 2,
      "softwareSystemId" : "6"
    }, {
      "automaticLayout" : {
        "applied" : false,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "elements" : [ {
        "id" : "4",
        "x" : 0,
        "y" : 0
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-002",
      "order" : 3,
      "softwareSystemId" : "4"
    }, {
      "automaticLayout" : {
        "applied" : false,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "elements" : [ {
        "id" : "2",
        "x" : 0,
        "y" : 0
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-003",
      "order" : 4,
      "softwareSystemId" : "2"
    }, {
      "automaticLayout" : {
        "applied" : true,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "dimensions" : {
        "height" : 794,
        "width" : 890
      },
      "elements" : [ {
        "id" : "1",
        "x" : 220,
        "y" : 185
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-004",
      "order" : 5,
      "softwareSystemId" : "1"
    }, {
      "automaticLayout" : {
        "applied" : false,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "elements" : [ {
        "id" : "3",
        "x" : 0,
        "y" : 0
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-005",
      "order" : 6,
      "softwareSystemId" : "3"
    }, {
      "automaticLayout" : {
        "applied" : false,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "elements" : [ {
        "id" : "5",
        "x" : 0,
        "y" : 0
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemContext-006",
      "order" : 7,
      "softwareSystemId" : "5"
    } ],
    "systemLandscapeViews" : [ {
      "automaticLayout" : {
        "applied" : true,
        "edgeSeparation" : 0,
        "implementation" : "Graphviz",
        "nodeSeparation" : 300,
        "rankDirection" : "TopBottom",
        "rankSeparation" : 300,
        "vertices" : false
      },
      "dimensions" : {
        "height" : 794,
        "width" : 4640
      },
      "elements" : [ {
        "id" : "1",
        "x" : 969,
        "y" : 185
      }, {
        "id" : "2",
        "x" : 219,
        "y" : 185
      }, {
        "id" : "3",
        "x" : 2469,
        "y" : 185
      }, {
        "id" : "4",
        "x" : 1719,
        "y" : 185
      }, {
        "id" : "5",
        "x" : 3969,
        "y" : 185
      }, {
        "id" : "6",
        "x" : 3219,
        "y" : 185
      } ],
      "enterpriseBoundaryVisible" : true,
      "generatedKey" : true,
      "key" : "SystemLandscape-001",
      "order" : 1
    } ]
  }
}